import React from 'react';

const Question = () => {
    return (
        <div>
            <h2>১। রিয়েক্ট কিভাবে কাজ করে?</h2>
            <p>রিয়েক্ট হল মোবাইল এবং ওয়েব অ্যাপ্লিকেশন ডেভেলপমেন্টের জন্য সবচেয়ে জনপ্রিয় জাভাস্ক্রিপ্ট লাইব্রেরিগুলোর মধ্যে একটি। রিয়েক্ট ঝামেলা ছাড়া UI তৈরি করে। কম্পোনেন্ট তৈরি করে সহজে স্টেট পরিচালনা করা যায়, খুব সহজেই ডাটা পাঠানো যায়। রিয়েক্ট এর মাধ্যমে HTML এর কোড লেখা যায় JSX এর মাধ্যমে। </p>
            <h2>২। প্রপস এবং স্টেট এর মধ্যে পার্থক্য?</h2>
            <p>প্রপসঃ প্রপস অপরিবর্তনীয়। এটি রিয়েক্টে খুব তাড়াতাড়ি রেফারেন্স চেক করতে দেয়। এটি উপর এর উপাদান। প্রপস এর মাধ্যমে child কম্পোনেন্টে ডাটা পাঠাতে ব্যবহার করে।</p>
            <p>স্টেটঃ এটা পরিবর্তনশীল। স্টেট এর মাধ্যমে child কম্পোনেন্ট থেকে ডাটা  এক্সেস করা ঠিক না। স্টেট কম্পোনেন্ট সম্পর্কে তথ্য ধারণ করে। স্টেট ছাড়া কম্পোনেন্টে থাকতে পারে না।</p>
        </div>
    );
};

export default Question;